cases/twoDCounterflowFlame/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/sampleConfigDict"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $TFuel;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform $TFuel;
    }
    air
    {
        type            fixedValue;
        value           uniform $TAir;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $TAir;
        value           uniform $TAir;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
