cases/twoDCounterflowFlame/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "sampleConfigDict"

vertices
(
    (0.0            0.0             -0.0001)
    ($domainWidth   0.0             -0.0001)
    ($domainWidth   $domainLength   -0.0001)
    (0.0            $domainLength   -0.0001)
    (0.0            0.0              0.0001)
    ($domainWidth   0.0              0.0001)
    ($domainWidth   $domainLength    0.0001)
    (0.0            $domainLength    0.0001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cellsAlongWidth $cellsAlongLength 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fuel
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    air
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 1 5 4)
            (7 6 2 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
