cases/twoDCounterflowFlame/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "sampleConfigDict"

application         dfLowMachFoam;

startFrom           startTime;
startTime           0;
stopAt              endTime;
endTime             $simEndTime;

deltaT              1e-08;
// maxDeltaT        0.0000190;

writeControl        adjustableRunTime;
writeInterval       $simWriteInterval;

purgeWrite          0;
writeFormat         ascii;
writePrecision      6;
writeCompression    off;

timeFormat          general;
timePrecision       7;

runTimeModifiable   true;
adjustTimeStep      off;
maxCo               0.4;

// ************************************************************************* //
